prst/TMS320F28xxx/F28027_EPwmTimerInt.c
/* ========================================================================== */
/* ========================================================================== */
//  Group:          C2000
//  Target Device:  TMS320F2802x
/* ========================================================================== */
/* ========================================================================== */

#include "./include/DSP28x_Project.h" // Device Headerfile and Examples Include File
#include "./include/F2802x_Examples.h"
#include "./include/cpu.h"
#include "./include/clk.h"
#include "./include/flash.h"
#include "./include/gpio.h"
#include "./include/pll.h"
#include "./include/pwm.h"
#include "./include/wdog.h"
#include "./include/pie.h"
//#include "./include/pie_init.h"
#include "./include/timer.h"

#include "./include/adc.h"
#include "./include/sci.h"


/* ========================================================================== */
// Configure which ePWM timer interrupts are enabled at the PIE level:
// 1 = enabled,  0 = disabled
#define PWM1_INT_ENABLE   0
#define PWM2_INT_ENABLE   0
#define PWM3_INT_ENABLE   0

// Configure the period for each timer
#define PWM1_TIMER_TBPRD  0xFFFF
//#define PWM1_TIMER_TBPRD  0x1FFF
#define PWM2_TIMER_TBPRD  0x1FFF
#define PWM3_TIMER_TBPRD  0x1FFF

//#define CPU_FREQ          (40E6)   // Default = 40 MHz. Change to 50E6 for 50 MHz devices
#define CPU_FREQ          CPU_FRQ_50MHZ // Default = 40 MHz. Change to 50E6 for 50 MHz devices
#define LSPCLK_FREQ       (CPU_FREQ/4)

//#define CPU_FRQ_40MHZ
//#define CPU_FRQ_50MHZ
//#define CPU_FRQ_60MHZ

#define SCI_FREQ          100E3
#define SCI_PRD           (LSPCLK_FREQ/(SCI_FREQ*8))-1

typedef enum {
	E_OK,
	E_FAIL,
	E_BADPTR
} t_error;

// Prototype statements for functions found within this file.
interrupt void  sciaTxFifoIsr (void);
interrupt void  sciaRxFifoIsr (void);
//interrupt void scibTxFifoIsr(void);
//interrupt void scibRxFifoIsr(void);
void  scia_init(void);
void  scia_fifo_init(void);
void  error(void);

void  scia_echoback_init (void);
void  scia_xmit (int a);
void  scia_msg (char * msg);
void  scia_echoback_fifo_init (void);

// Prototype statements for functions found within this file.
interrupt void epwm1_timer_isr(void);
interrupt void epwm2_timer_isr(void);
interrupt void epwm3_timer_isr(void);
interrupt void timer0_isr(void);
void init_EPwmTimer(void);

t_error wrapper_Init_Sys (void);
t_error wrapper_Init_PWM_IRQs (void);
t_error wrapper_Init_GPIO (void);
t_error wrapper_Init_UART_pooling (void);
t_error wrapper_Init_UART_IRQ (void);
void    wrapper_Main ( void );
void    wrapper_Error_Handle( t_error err );


/* ========================================================================== */
/* Global variables */
/* ========================================================================== */

uint32_t     EPwm1TimerIntCount;
uint32_t     EPwm2TimerIntCount;
uint32_t     EPwm3TimerIntCount;
uint32_t     Timer0IntCount;

CPU_Handle   myCpu;
PLL_Handle   myPll;
CLK_Handle   myClk;
FLASH_Handle myFlash;
ADC_Handle   myAdc;
SCI_Handle   mySci;
GPIO_Handle  myGpio;
PIE_Handle   myPie;
PWM_Handle   myPwm1, myPwm2, myPwm3;
TIMER_Handle myTimer;
WDOG_Handle  myWDog;
t_error      err = E_OK;
int          i=0;
int          i_pwm0=0;

uint16_t     sdataA[2];     // Send data for SCI-A
uint16_t     rdataA[2];     // Received data for SCI-A
uint16_t     rdata_pointA;  // Used for checking the received data

char         *p_sci_msg;
uint16_t     LoopCount;
uint16_t     ErrorCount;
uint16_t     ReceivedChar;



/* ==========================================================================
 * MAIN
 * ========================================================================== */
void main(void) {
	if (E_OK==err) {
        err = wrapper_Init_Sys ();     	 // Init system and handles
    } else {
    	wrapper_Error_Handle (err);
    }
    
    /*if (E_OK==err) {
        err = wrapper_Init_PWM_IRQs ();  // Init IRQs
    } else {
    	wrapper_Error_Handle (err);
    }*/

    if (E_OK==err) {
    	err = wrapper_Init_GPIO ();   // Init GPIO system
    } else {
    	wrapper_Error_Handle (err);
    }

    if (E_OK==err) {
    	//err = wrapper_Init_UART_IRQ ();   // Init UART IRQ
    	err = wrapper_Init_UART_pooling ();   // Init UART without IRQ
    } else {
    	wrapper_Error_Handle (err);
    }
    //sciaTxFifoIsr();

	// Main code
    for(;;) {
    	wrapper_Main();
    }
}
/* ========================================================================== */


typedef enum {
	TERMINAL_PRINT=0,
	TERMINAL_READ,
	TERMINAL_SHOW,
	TERMINAL_ENTER,
	TERMINAL_WAIT,
} t_terminal_state;


/* ==========================================================================
 * NAME - Wrapper_Main
 * IN   - void
 * OUT  - void
 * RET  - void
   ========================================================================== */
void wrapper_Main ( void ) {
	uint16_t  ui16_gpio_in;

    /* asm (" NOP");
    for ( i=1; i<=10; i++ ) {
        GPIO_setPortData (myGpio, GPIO_Port_A, i );
    }  */

	// Describe of functionality
	// - UART Terminal for control
	// -- Timer #0 as base CLI (Command Line Interface)
	// -- CLI (Command Line Interface)
	// -- PWM #0, #1, #2 : On-Off
	// -- UART_PWM_generator
	// -- LCD and LEDs
	// -- GPIO


	// -- GPIO
	ui16_gpio_in = GPIO_getPortData (myGpio, GPIO_Port_A);
	if ( ui16_gpio_in & (1<<12) ) {
		//GPIO_setLow(myGpio, GPIO_Number_0 );
		GPIO_setPortData (myGpio, GPIO_Port_A, 0xF );
		//SCI_write(mySci, '3');
	} else {
		//GPIO_setHigh(myGpio, GPIO_Number_0 );
		GPIO_setPortData (myGpio, GPIO_Port_A, 0xE );
	}

    {
    	t_terminal_state terminal_state;
		static uint16_t  try=0xffff;

    	switch ( terminal_state ){
    		case TERMINAL_PRINT:
    	    	p_sci_msg = "\rEnter a character: \0";
    	        scia_msg(p_sci_msg);
    			terminal_state = TERMINAL_READ;
    		break;

    		case TERMINAL_READ:
    	        if (SCI_getRxFifoStatus(mySci) >= SCI_FifoStatus_1_Word) {
    	            ReceivedChar = SCI_getData(mySci); // Get character
        			terminal_state = TERMINAL_SHOW;
    	        } else {
        			if (--try)
        				terminal_state = TERMINAL_READ;
        			else
        				terminal_state = TERMINAL_SHOW;
    	        }
    		break;

