prst/TMS320F28xxx/F28027_EPwmTimerInt.c
/* ==========================================================================
 * NAME - scia_echoback_init
 * IN   - void
 * OUT  - void
 * RET  - void
   ========================================================================== */
// Test 1,SCIA  DLB, 8-bit word, baud rate 0x000F, default, 1 STOP bit, no parity
void scia_echoback_init (void) {
    CLK_enableSciaClock(myClk);

    // 1 stop bit, No loopback, No parity,8 char bits, async mode, idle-line protocol
    SCI_disableParity(mySci);
    SCI_setNumStopBits(mySci, SCI_NumStopBits_One);
    SCI_setCharLength(mySci, SCI_CharLength_8_Bits);

    SCI_enableTx(mySci);
    SCI_enableRx(mySci);
    SCI_enableTxInt(mySci);
    SCI_enableRxInt(mySci);

    // SCI BRR = LSPCLK/(SCI BAUDx8) - 1
#if (CPU_FRQ_60MHZ)
    SCI_setBaudRate(mySci, (SCI_BaudRate_e)194);
#elif (CPU_FRQ_50MHZ)
    //SCI_setBaudRate(mySci, (SCI_BaudRate_e)162);  // @ 9600
    SCI_setBaudRate(mySci, (SCI_BaudRate_e)13);   // @ 115200
#elif (CPU_FRQ_40MHZ)
    SCI_setBaudRate(mySci, (SCI_BaudRate_e)129);
#endif
    SCI_enable(mySci);

    return;
}
/* ========================================================================== */



/* ==========================================================================
 * NAME - scia_xmit
 * IN   - int
 * OUT  - void
 * RET  - void
   ========================================================================== */
// Transmit a character from the SCI
void scia_xmit (int a) {
//    while (SciaRegs.SCIFFTX.bit.TXFFST != 0) {}
    while(SCI_getTxFifoStatus(mySci) != SCI_FifoStatus_Empty){
    }
//    SciaRegs.SCITXBUF=a;
    SCI_putDataBlocking(mySci, a);
}
/* ========================================================================== */



/* ==========================================================================
 * NAME - scia_msg
 * IN   - char *
 * OUT  - void
 * RET  - void
   ========================================================================== */
void scia_msg (char * msg) {
    int i;
    i = 0;
    while(msg[i] != '\0')     {
        scia_xmit(msg[i]);
        i++;
    }
}
/* ========================================================================== */



/* ==========================================================================
 * NAME - scia_echoback_fifo_init
 * IN   - void
 * OUT  - void
 * RET  - void
   ========================================================================== */
// Initalize the SCI FIFO
void scia_echoback_fifo_init (void) {
    SCI_enableFifoEnh(mySci);
    SCI_resetTxFifo(mySci);
    SCI_clearTxFifoInt(mySci);
    SCI_resetChannels(mySci);
    SCI_setTxFifoIntLevel(mySci, SCI_FifoLevel_Empty);

    SCI_resetRxFifo(mySci);
    SCI_clearRxFifoInt(mySci);
    SCI_setRxFifoIntLevel(mySci, SCI_FifoLevel_4_Words);

    return;
}
/* ========================================================================== */


//===========================================================================
// No more.
//===========================================================================
